testing/artillery/MsSqlGuid.yml
config:
  target: 'http://localhost:55204'
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 5
      arrivalRate: 100
scenarios:
  - flow:
      - post:
          url: "/MsSql/Guid"
          json:
            firstName: "firstname"
            surname: "lastname"
            idNumber: "idnumber"